{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting deployment error diagnosis work, linking frontend CSS and HomePage files with core infrastructure and build components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a Banana Split game application with jungle theme, routing, privacy policy, and banana-themed styling.",
  "frontend/index.css": "Base Tailwind CSS configuration with OKLCH color variables for light and dark modes using a neutral grayscale palette.",
  "frontend/index.html": "HTML entry point with 'RedVelvet Productions' title and root div for React mounting.",
  "frontend/src/App.tsx": "TanStack Router setup with root layout (Header/Footer) and routes for home and privacy pages.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright for RedVelvet Productions, animated heart icon, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky header with 'Banana Split' branding and navigation buttons for Home and Privacy Policy with active state styling.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP backend actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication with login/logout functionality and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for React Query hooks that interact with the backend.",
  "frontend/src/index.css": "Tailwind CSS with banana-themed OKLCH color system, jungle parallax background image, gradient overlay, and custom button styles for light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional Tailwind CSS class merging.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component for Banana Split game featuring hero section with jungle banner, game description cards highlighting gorilla gameplay, multiple maps, and grabbable items with environment showcase sections.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page component displaying information collection practices for Chimp Factory and BananaSplit games, including what data is collected (username, platform ID, gameplay data) and what is not collected (passwords, payment info).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme with OKLCH color system, banana/jungle themed colors, extended border radius values, custom shadows, and container/typography plugins.",
  "project_state.json": "Project state metadata file indicating this is a fix request for a deployment error that occurred during build and deploy sequence, with schema version 1.0.0 and project state version 3."
}